app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "vijayendran91"], ["LIMIT", 1]]
---
          <%=link_to article.title,user_article_path(article.username,article.id)%> -
          <%= User.find_by_username(article.username).fname+" "+User.find_by_username(article.username).lname%>