app/controllers/articles_controller.rb

  def create
    @article=Article.new(article_params)
    @article.user=User.first

    @article.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?)

  def update
    @article=Article.find(params[:id])
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "Lorem Ipsum Nil Nisi Bonum"], ["updated_at", "2018-03-19 09:31:41.417669"], ["id", 1]]