app/controllers/articles_controller.rb

  def index
    @user=User.find_by_username(params[:user_id])
    @article=(Article.where(username: @user.username))
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "vijayendran91"], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."username" = ? LIMIT ?  [["username", "vijayendran91"], ["LIMIT", 1]]