app/controllers/sessions_controller.rb

  def create
    if params[:session][:username]
      user = User.find_by(username: params[:session][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "vijayendran91"], ["LIMIT", 1]]