app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
   if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest", "fname", "lname") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @user=User.find_by_username (params[:id])
    @all_user=User.all
    @current_user=current_user
    @articles=Article.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "vijayendran91"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (vijayendran91) LIMIT ?  [["LIMIT", 1]]
SELECT "articles".* FROM "articles"